remove_sdc

create_clock -period $PERIOD [get_ports clk]
create_clock -period $PERIOD [get_ports clk_1]
create_clock -period $PERIOD [get_ports clk_2]

#set_clock_groups -asynchronous -group clk -group [list clk_1 clk_2]

set_drive 1 {mode mem_d_out}
set_load [load_of slow/CLKBUFX20/A] [all_outputs]




